{
    "AND": "Andromeda is associated with artistic talent, intuition, and a strong connection to dreams and the subconscious.",
    "ANT": "Antlia's astrological significance is less defined, but it can be linked to innovation and the unseen forces that drive progress.",
    "APS": "Apus is often associated with a love of beauty, exotic experiences, and a free-spirited nature.",
    "AQR": "Aquarius is the sign of the Water Bearer, symbolizing humanitarianism, innovation, and a focus on social justice and future possibilities.",
    "AQL": "Aquila is linked to sharp vision, courage, and soaring ambition, often associated with leadership qualities.",
    "ARA": "Ara represents focus and dedication, suggesting a capacity for spiritual pursuits and a strong sense of purpose.",
    "ARI": "Aries is the first sign of the zodiac, embodying energy, initiative, courage, and a pioneering spirit.",
    "AUR": "Auriga is associated with responsibility, guidance, and the ability to steer one's life with skill and purpose.",
    "BOO": "Boötes is linked to a grounded nature, patience, and a connection to the earth and its rhythms.",
    "CAS": "Cassiopeia can represent pride, a desire for recognition, and the consequences of vanity or self-importance.",
    "CMA": "Canis Major is associated with loyalty, protection, and a strong, faithful nature, often linked to companionship.",
    "CYG": "Cygnus symbolizes transformation, grace, and the beauty found in change and transition.",
    "GEM": "Gemini is the sign of the Twins, representing duality, communication, intellect, and adaptability.",
    "LEO": "Leo is the sign of the Lion, embodying confidence, creativity, leadership, and a generous spirit.",
    "LYR": "Lyra is associated with harmony, artistic expression, and the power of music and creativity to uplift.",
    "ORI": "Orion represents strength, courage, and a powerful, sometimes impulsive, nature, often associated with being a hunter or protector.",
    "PEG": "Pegasus symbolizes inspiration, freedom, and the ability to transcend limitations and achieve the seemingly impossible.",
    "PER": "Perseus is associated with bravery, quick thinking, and the ability to overcome challenges through decisive action.",
    "PSA": "Piscis Austrinus is linked to the flow of nourishment and support, often seen as a receiver of vital energies.",
    "SGR": "Sagittarius is the sign of the Archer, embodying adventure, optimism, a quest for knowledge, and a philosophical outlook.",
    "SCO": "Scorpius is associated with intensity, transformation, passion, and the ability to delve into the deeper aspects of life.",
    "TAU": "Taurus is the sign of the Bull, representing stability, sensuality, determination, and a connection to the material world.",
    "UMA": "Ursa Major is associated with guidance, strength, and a maternal or nurturing energy, often seen as a protector.",
    "UMI": "Ursa Minor is linked to inner guidance, finding one's true north, and a more subtle, internal strength.",
    "VIR": "Virgo is the sign of the Virgin, embodying practicality, analytical skills, service, and attention to detail.",
    "CAE": "Caelum's astrological significance is less defined, but it can be linked to precision and the tools we use to shape our reality.",
    "CAM": "Camelopardalis is associated with far-reaching vision, patience, and the ability to see things from a unique perspective.",
    "CNC": "Cancer is the sign of the Crab, embodying nurturing, emotional sensitivity, home, and family.",
    "CVN": "Canes Venatici are associated with loyalty, companionship, and the pursuit of one's goals with dedication.",
    "CMI": "Canis Minor is linked to faithful companionship and can represent a close and supportive relationship.",
    "CAP": "Capricornus is the sign of the Sea Goat, embodying discipline, ambition, responsibility, and a focus on long-term achievements.",
    "CAR": "Carina, as part of the ship Argo, can symbolize voyages, journeys, and navigating life's challenges.",
    "CEN": "Centaurus is associated with wisdom, teaching, and the balance between instinct and intellect.",
    "CEP": "Cepheus represents authority, leadership, and the establishment of order and structure.",
    "CET": "Cetus can symbolize facing deep emotions or powerful forces, and the potential for transformation through these encounters.",
    "CHA": "Chamaeleon is associated with adaptability, blending in, and the ability to see things from multiple perspectives.",
    "CIR": "Circinus's astrological significance is less defined, but it can be linked to precision and the drawing of boundaries.",
    "COL": "Columba is associated with peace, hope, and messages of love and reconciliation.",
    "COM": "Coma Berenices can symbolize sacrifice, beauty, and the enduring nature of cherished things.",
    "CRA": "Corona Australis is associated with rewards, completion, and the recognition of achievements.",
    "CRB": "Corona Borealis represents honor, glory, and the culmination of efforts, often linked to partnership.",
    "CRV": "Corvus can symbolize insight, intelligence, and the uncovering of hidden truths, sometimes with a warning.",
    "CRT": "Crater is associated with emotional containment and the holding of one's feelings or experiences.",
    "CRU": "Crux is a guiding light in the Southern Hemisphere, often associated with faith, guidance, and pivotal moments.",
    "DEL": "Delphinus symbolizes joy, playfulness, and helpfulness, often associated with rescue or assistance.",
    "DOR": "Dorado's astrological significance is less defined, but it can be linked to exploration and the discovery of new horizons.",
    "DRA": "Draco represents hidden wisdom, protection of valuable things, and the overcoming of obstacles.",
    "EQU": "Equuleus is associated with swiftness, agility, and a spark of potential or a quick burst of energy.",
    "ERI": "Eridanus can symbolize the flow of life, journeys, and the passage of time.",
    "FOR": "Fornax's astrological significance is less defined, but it can be linked to transformation and the refining of raw materials.",
    "GRU": "Grus is associated with vigilance, longevity, and a graceful presence.",
    "HER": "Hercules embodies strength, courage, perseverance, and the triumph over adversity.",
    "HOR": "Horologium's astrological significance is less defined, but it can be linked to timing, cycles, and the measurement of life's phases.",
    "HYA": "Hydra can symbolize endurance, persistence, and the challenge of overcoming multifaceted obstacles.",
    "HYI": "Hydrus's astrological significance is less defined, but it can be linked to adaptability in watery or emotional realms.",
    "IND": "Indus is associated with a connection to nature, simplicity, and perhaps a wisdom gained from observation.",
    "LAC": "Lacerta's astrological significance is less defined, but it can be linked to adaptability and a subtle presence.",
    "LMI": "Leo Minor can represent subtle strength, quiet confidence, and understated power.",
    "LEP": "Lepus can symbolize quickness, vulnerability, and the feeling of being pursued or the need to be alert.",
    "LIB": "Libra is the sign of the Scales, embodying balance, harmony, justice, and relationships.",
    "LUP": "Lupus can symbolize primal instincts, loyalty to the pack, and a potentially untamed nature.",
    "LYN": "Lynx's astrological significance is less defined, but it can be linked to keen observation and hidden awareness.",
    "MEN": "Mensa's astrological significance is less defined, perhaps representing a foundation or a place of contemplation.",
    "MIC": "Microscopium's astrological significance is less defined, but it can be linked to detail, analysis, and looking closely at things.",
    "MON": "Monoceros can symbolize uniqueness, individuality, and the pursuit of the rare or elusive.",
    "MUS": "Musca's astrological significance is less defined, perhaps representing minor irritations or the unnoticed aspects of life.",
    "NOR": "Norma's astrological significance is less defined, but it can be linked to structure, order, and adherence to principles.",
    "OCT": "Octans's astrological significance is less defined, but its containing the South Celestial Pole might link it to orientation and finding one's place.",
    "OPH": "Ophiuchus is associated with healing, transformation, and the struggle between life and death, often linked to wisdom and medicine.",
    "PAV": "Pavo is associated with beauty, display, and a sense of pride or self-expression.",
    "PHE": "Phoenix symbolizes rebirth, renewal, and the ability to rise from adversity.",
    "PIC": "Pictor's astrological significance is less defined, but it can be linked to creativity and artistic expression.",
    "PSC": "Pisces is the last sign of the zodiac, embodying compassion, intuition, spirituality, and a connection to the collective unconscious.",
    "PUP": "Puppis, as part of the ship Argo, can symbolize the journey's end or the solid foundation of one's endeavors.",
    "PYX": "Pyxis, originally part of Argo Navis, can symbolize direction, navigation, and finding one's way.",
    "RET": "Reticulum's astrological significance is less defined, but it can be linked to measurement and precision in observation.",
    "SGE": "Sagitta can symbolize focus, directness, and the swift pursuit of a goal.",
    "SCL": "Sculptor's astrological significance is less defined, but it can be linked to shaping one's reality and creative endeavors.",
    "SCT": "Scutum can symbolize protection, defense, and standing up for one's beliefs or community.",
    "SER": "Serpens, held by Ophiuchus, can represent healing, transformation, and the duality of wisdom and temptation.",
    "SEX": "Sextans's astrological significance is less defined, but it can be linked to measurement and assessment of situations.",
    "TEL": "Telescopium's astrological significance is less defined, but it can be linked to seeking knowledge and distant perspectives.",
    "TRI": "Triangulum can symbolize harmony, balance, and the coming together of different elements.",
    "TRA": "Triangulum Australe's astrological significance is less defined, but it can represent balance and connection in the southern hemisphere.",
    "TUC": "Tucana's astrological significance is less defined, often associated with the exotic and exploration of new territories.",
    "VEL": "Vela, as part of the ship Argo, can symbolize the journey itself and the power of movement and progress.",
    "VOL": "Volans's astrological significance is less defined, but it can be linked to taking leaps and embracing new possibilities.",
    "VUL": "Vulpecula's astrological significance is less defined, perhaps representing cleverness or a subtle approach."
}