{
    "AND": "Andromeda was the daughter of Cepheus and Cassiopeia, king and queen of Aethiopia. Cassiopeia boasted her daughter was more beautiful than the Nereids, angering Poseidon who sent the sea monster Cetus. Andromeda was chained to a rock as a sacrifice but was saved by Perseus.",
    "ANT": "Antlia (the Air Pump) was named by Lacaille in the 18th century, representing the scientific instrument.",
    "APS": "Apus (the Bird-of-paradise) was conceived by Dutch navigators Keyser and de Houtman in the late 16th century.",
    "AQR": "Aquarius (the Water Bearer) is often identified with Ganymede, the beautiful Phrygian boy whom Zeus abducted to be the cupbearer for the gods.",
    "AQL": "Aquila (the Eagle) represents the eagle that carried Zeus's thunderbolts and abducted Ganymede.",
    "ARA": "Ara (the Altar) is identified as the altar where the gods swore allegiance before battling the Titans.",
    "ARI": "Aries (the Ram) represents the golden ram whose fleece was sought by Jason and the Argonauts.",
    "AUR": "Auriga (the Charioteer) is often identified with Erichthonius, the mythical king of Athens who invented the four-horse chariot.",
    "BOO": "Boötes (the Herdsman) is often depicted chasing Ursa Major around the North Pole.",
    "CAS": "Cassiopeia was a queen known for her vanity. She boasted she was more beautiful than the Nereids and was placed in the sky, tied to a chair, as punishment.",
    "CMA": "Canis Major (the Great Dog) represents Laelaps, the fastest dog in the world, destined to catch whatever it pursued.",
    "CYG": "Cygnus (the Swan) represents the form Zeus took to seduce Leda, or sometimes Orpheus transformed into a swan after his death.",
    "GEM": "Gemini (the Twins) represents Castor and Pollux, twin brothers with different fathers. When Castor died, Pollux asked Zeus to let him share his own immortality with his twin, and they were transformed into the constellation.",
    "LEO": "Leo (the Lion) represents the Nemean Lion, which was killed by Heracles (Hercules) as the first of his twelve labours.",
    "LYR": "Lyra (the Lyre) represents the lyre of Orpheus, the legendary musician.",
    "ORI": "Orion was a giant huntsman whom Zeus placed among the stars as the constellation of Orion after his death by a scorpion's sting.",
    "PEG": "Pegasus is the mythical winged horse, born from the blood of Medusa after Perseus beheaded her.",
    "PER": "Perseus is the Greek hero who slew Medusa and rescued Andromeda from the sea monster Cetus.",
    "PSA": "Piscis Austrinus (the Southern Fish) is depicted as drinking the water poured by Aquarius.",
    "SGR": "Sagittarius (the Archer) is often identified as a centaur, possibly Chiron, aiming his arrow towards the heart of Scorpius.",
    "SCO": "Scorpius (the Scorpion) represents the scorpion sent by Gaia or Hera to kill Orion. The two constellations were placed on opposite sides of the sky.",
    "TAU": "Taurus (the Bull) represents the bull form Zeus took to abduct Europa, or sometimes the Cretan Bull captured by Heracles.",
    "UMA": "Ursa Major (the Great Bear) represents the nymph Callisto, who was transformed into a bear by a jealous Hera and placed in the sky by Zeus.",
    "UMI": "Ursa Minor (the Little Bear) represents Arcas, the son of Callisto, also turned into a bear and placed in the sky.",
    "VIR": "Virgo (the Virgin) is often associated with Dike, the Greek goddess of justice, or sometimes Persephone, queen of the underworld.",
    "CAE": "Caelum (the Chisel) - Named by Lacaille.",
    "CAM": "Camelopardalis (the Giraffe) - Named by Plancius.",
    "CNC": "Cancer (the Crab) - Sent by Hera to distract Heracles during his fight with the Hydra.",
    "CVN": "Canes Venatici (the Hunting Dogs) - Represent the dogs Asterion and Chara, held by Boötes.",
    "CMI": "Canis Minor (the Lesser Dog) - Represents the dog Maera, or one of Orion's hunting dogs.",
    "CAP": "Capricornus (the Sea Goat) - Associated with the god Pan, who transformed himself into a goat-fish to escape the monster Typhon.",
    "CAR": "Carina (the Keel) - Part of the former constellation Argo Navis, the ship of the Argonauts.",
    "CEN": "Centaurus (the Centaur) - Often identified as Chiron, the wise centaur tutor.",
    "CEP": "Cepheus (the King) - King of Aethiopia, husband of Cassiopeia and father of Andromeda.",
    "CET": "Cetus (the Whale/Sea Monster) - The sea monster sent by Poseidon to plague Aethiopia.",
    "CHA": "Chamaeleon (the Chameleon) - Named by Keyser and de Houtman.",
    "CIR": "Circinus (the Compasses) - Named by Lacaille.",
    "COL": "Columba (the Dove) - Possibly represents the dove released by Noah, or the dove that guided the Argonauts.",
    "COM": "Coma Berenices (Berenice's Hair) - Represents the hair Queen Berenice II of Egypt sacrificed for her husband's safe return.",
    "CRA": "Corona Australis (the Southern Crown) - Sometimes associated with the crown of Sagittarius or a wreath placed by Dionysus.",
    "CRB": "Corona Borealis (the Northern Crown) - Represents the crown given by Dionysus to Ariadne.",
    "CRV": "Corvus (the Crow) - Represents Apollo's sacred crow, punished for tardiness and betrayal.",
    "CRT": "Crater (the Cup) - Represents the cup held by Apollo's crow.",
    "CRU": "Crux (the Southern Cross) - A prominent southern constellation, used for navigation.",
    "DEL": "Delphinus (the Dolphin) - Represents the dolphin sent by Poseidon to find Amphitrite, or the dolphin that saved the musician Arion.",
    "DOR": "Dorado (the Dolphinfish/Swordfish) - Named by Keyser and de Houtman.",
    "DRA": "Draco (the Dragon) - Represents Ladon, the dragon guarding the golden apples in the Garden of the Hesperides.",
    "EQU": "Equuleus (the Little Horse/Foal) - Possibly Celeris, the sibling or offspring of Pegasus.",
    "ERI": "Eridanus (the River) - Represents a mythical river, possibly the Nile or Po.",
    "FOR": "Fornax (the Furnace) - Named by Lacaille.",
    "GRU": "Grus (the Crane) - Named by Keyser and de Houtman.",
    "HER": "Hercules - The Roman name for the Greek hero Heracles, known for his strength and twelve labours.",
    "HOR": "Horologium (the Clock) - Named by Lacaille.",
    "HYA": "Hydra (the Water Serpent) - Represents the Lernaean Hydra slain by Heracles.",
    "HYI": "Hydrus (the Male Water Snake) - Named by Keyser and de Houtman.",
    "IND": "Indus (the Indian) - Named by Keyser and de Houtman.",
    "LAC": "Lacerta (the Lizard) - Named by Hevelius.",
    "LMI": "Leo Minor (the Lesser Lion) - Named by Hevelius.",
    "LEP": "Lepus (the Hare) - Placed near Orion, possibly the hunter's prey.",
    "LIB": "Libra (the Scales) - Represents the scales of justice, held by Virgo (Dike).",
    "LUP": "Lupus (the Wolf) - An ancient constellation, possibly representing an impaled animal sacrifice.",
    "LYN": "Lynx - Named by Hevelius because its stars are faint, requiring the eyesight of a lynx.",
    "MEN": "Mensa (Table Mountain) - Named by Lacaille after Table Mountain in South Africa.",
    "MIC": "Microscopium (the Microscope) - Named by Lacaille.",
    "MON": "Monoceros (the Unicorn) - Named by Plancius.",
    "MUS": "Musca (the Fly) - Named by Keyser and de Houtman.",
    "NOR": "Norma (the Level/Square) - Named by Lacaille.",
    "OCT": "Octans (the Octant) - Named by Lacaille, contains the South Celestial Pole.",
    "OPH": "Ophiuchus (the Serpent Bearer) - Represents Asclepius, the healer who could revive the dead, holding a serpent.",
    "PAV": "Pavo (the Peacock) - Named by Keyser and de Houtman, associated with Hera's sacred bird.",
    "PHE": "Phoenix - Named by Keyser and de Houtman after the mythical bird.",
    "PIC": "Pictor (the Painter's Easel) - Named by Lacaille.",
    "PSC": "Pisces (the Fishes) - Represent Aphrodite and Eros, who transformed into fish to escape the monster Typhon.",
    "PUP": "Puppis (the Stern) - Part of the former constellation Argo Navis.",
    "PYX": "Pyxis (the Mariner's Compass) - Named by Lacaille, originally part of Argo Navis.",
    "RET": "Reticulum (the Reticle) - Named by Lacaille.",
    "SGE": "Sagitta (the Arrow) - Represents the arrow shot by Heracles towards Aquila, or Cupid's arrow.",
    "SCL": "Sculptor (the Sculptor's Studio) - Named by Lacaille.",
    "SCT": "Scutum (the Shield) - Named by Hevelius in honor of King John III Sobieski of Poland.",
    "SER": "Serpens (the Serpent) - The serpent held by Ophiuchus, uniquely split into two parts (Serpens Caput and Serpens Cauda).",
    "SEX": "Sextans (the Sextant) - Named by Hevelius.",
    "TEL": "Telescopium (the Telescope) - Named by Lacaille.",
    "TRI": "Triangulum (the Triangle) - An ancient constellation, possibly representing Sicily or the Nile Delta.",
    "TRA": "Triangulum Australe (the Southern Triangle) - Named by Keyser and de Houtman.",
    "TUC": "Tucana (the Toucan) - Named by Keyser and de Houtman.",
    "VEL": "Vela (the Sails) - Part of the former constellation Argo Navis.",
    "VOL": "Volans (the Flying Fish) - Named by Keyser and de Houtman.",
    "VUL": "Vulpecula (the Little Fox) - Named by Hevelius."
}